examples/porousHeatTransferFoam/energyRelease/3DHeatSource/0.orig/T.fluid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T.fluid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    floor
    {
        type            fixedValue;
        value           uniform 300;
//	type            zeroGradient;
    }

    ceiling
    {
//		type            fixedValue;
//        value           uniform 300;
        type            zeroGradient;
    }
	"sym.*"
    {
        type            symmetryPlane;
		
    }
	walls
    {
		type            zeroGradient;
    }
}


// ************************************************************************* //
